nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe31b/driver_examples/flexio/uart/interrupt_transfer/pin_mux.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
 
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

 #ifndef _PIN_MUX_H_
 #define _PIN_MUX_H_
 
 #include "fsl_siul2.h"
 /*!
  * @addtogroup pin_mux
  * @{
  */
 
 /***********************************************************************************************************************
  * API
  **********************************************************************************************************************/
 
 #if defined(__cplusplus)
 extern "C" {
 #endif
 
 /*!
  * @brief Calls initialization functions.
  *
  */
 void BOARD_InitBootPins(void);
 
 /*!
  * @brief Configures pin routing and optionally pin electrical features.
  *
  */
 void BOARD_InitPins(void);
 
 #if defined(__cplusplus)
 }
 #endif
 
 /*!
  * @}
  */
 #endif /* _PIN_MUX_H_ */
 
 /***********************************************************************************************************************
  * EOF
  **********************************************************************************************************************/
 